#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Wed Oct 22 21:39:17 2025

add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/top.v"
add_constraint "D:/lab/FPGA/PDS/FPGA_game/project/source/project.fdc"
add_design D:/lab/FPGA/PDS/FPGA_game/project/ipcore/PLL/PLL.idf
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/Vpp_measure.v"
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/fre_duty_measure.v"
add_design D:/lab/FPGA/PDS/FPGA_game/project/ipcore/divider_unsigned32/divider_unsigned32.idf
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
remove_design D:/lab/FPGA/PDS/FPGA_game/project/ipcore/divider_unsigned32/divider_unsigned32.idf
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/divider.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/square_root.v"
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/binary2BCD.v"
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/display_HMI.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
add_design D:/lab/FPGA/PDS/FPGA_game/project/ipcore/wave_ram/wave_ram.idf
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/uart_tx.v"
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/uart_rx.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/adc_sample.v"
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/fft_calculation.v"
add_design D:/lab/FPGA/PDS/FPGA_game/project/ipcore/fft/fft.idf
add_design D:/lab/FPGA/PDS/FPGA_game/project/ipcore/hamming/hamming.idf
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/fft_transform.v"
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/cordic_arctan.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/adc_transform.v"
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/data2uart.v"
add_design D:/lab/FPGA/PDS/FPGA_game/project/ipcore/uart_fifo/uart_fifo.idf
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_netlist 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "D:/lab/FPGA/PDS/FPGA_game/project/project.lcf"
remove_constraint -force -logic -fdc "D:/lab/FPGA/PDS/FPGA_game/project/source/project.fdc"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
add_constraint "D:/lab/FPGA/PDS/FPGA_game/project/project.fdc"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
add_design "D:/lab/FPGA/PDS/FPGA_game/project/source/delay.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
add_fic "C:/Users/27102/Desktop/pds project/project/synthesize/top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
dev_map 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
add_design "C:/Users/27102/Desktop/pds project/project/source/threshold_warning.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module Vpp_measure
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
add_design "C:/Users/27102/Desktop/pds project/project/source/encoder.v"
add_design "C:/Users/27102/Desktop/pds project/project/source/data_judge.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
add_design C:/Users/27102/Desktop/pds project/project/ipcore/data_PLL/data_PLL.idf
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
dev_map 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
add_design "C:/Users/27102/Desktop/pds project/project/source/fre_measure.v"
add_design "C:/Users/27102/Desktop/pds project/project/source/div_fsm.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
add_design "C:/Users/27102/Desktop/pds project/project/source/thd_measure.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
remove_design -force -verilog "C:/Users/27102/Desktop/pds project/project/source/Vpp_measure.v"
remove_design -force -verilog "C:/Users/27102/Desktop/pds project/project/source/div_fsm.v"
remove_design -force -verilog "C:/Users/27102/Desktop/pds project/project/source/fre_measure.v"
remove_design -force C:/Users/27102/Desktop/pds project/project/ipcore/data_PLL/data_PLL.idf
add_design "C:/Users/27102/Desktop/pds project/project/source/Vpp_measure.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
add_design "C:/Users/27102/Desktop/pds project/project/source/phase_measure.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
add_design "C:/Users/27102/Desktop/pds project/project/source/de_IQ.v"
add_design "C:/Users/27102/Desktop/pds project/project/source/dds.v"
add_design C:/Users/27102/Desktop/pds project/project/ipcore/ROM_sin/ROM_sin.idf
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_design C:/Users/27102/Desktop/pds project/project/ipcore/adc_fifo/adc_fifo.idf
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
add_design "C:/Users/27102/Desktop/pds project/project/source/wave_judge.v"
add_design C:/Users/27102/Desktop/pds project/project/ipcore/fjw_ram/fjw_ram.idf
remove_design -force C:/Users/27102/Desktop/pds project/project/ipcore/fjw_ram/fjw_ram.idf
add_design C:/Users/27102/Desktop/pds project/project/ipcore/fjw_ram/fjw_ram.idf
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
add_design "C:/Users/27102/Desktop/pds project/project/source/weak_signal.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
add_design "C:/Users/27102/Desktop/pds project/project/source/esp8266.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
add_design C:/Users/27102/Desktop/pds project/project/ipcore/ROM_sin128/ROM_sin128.idf
add_design C:/Users/27102/Desktop/pds project/project/ipcore/ROM_square128/ROM_square128.idf
add_design C:/Users/27102/Desktop/pds project/project/ipcore/ROM_tria128/ROM_tria128.idf
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
add_design "C:/Users/27102/Desktop/pds project/project/source/data_select.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
dev_map 
dev_map 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -version_fallback_ctrl {Last used bit stream} -scbv {High Voltage} 
